ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28002x_trig_regs.xml
<module id="TRIG_REGS" HW_revision="" description="TRIG Registers">
	<register id="SYNCSELECT" width="32" page="1" offset="0x0" internal="0" description="Sync Input and Output Select Register">
		<bitfield id="EPWM4SYNCIN" description="Selects Sync Input Source for EPWM4" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="EPWM7SYNCIN" description="Selects Sync Input Source for EPWM7" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="EPWM10SYNCIN" description="Selects Sync Input Source for EPWM10" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="ECAP1SYNCIN" description="Selects Sync Input Source for ECAP1" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="ECAP4SYNCIN" description="Selects Sync Input Source for ECAP4" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="ECAP7SYNCIN" description="Selects Sync Input Source for ECAP7" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="EPWM13SYNCIN" description="Selects Sync Input Source for EPWM13" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="SYNCOUT1" description="Select Syncout Source" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="SYNCOUT" description="Select Syncout Source" begin="28" end="27" width="2" rwaccess="RW"/>
		<bitfield id="EPWM1SYNCIN" description="Selects Sync Input Source for EPWM1 " begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="ADCSOCOUTSELECT" width="32" page="1" offset="0x2" internal="0" description="External ADC (Off Chip) SOC Select Register">
		<bitfield id="PWM1SOCAEN" description="PWM1SOCAEN Enable for ADCSOCAOn " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PWM2SOCAEN" description="PWM2SOCAEN Enable for ADCSOCAOn " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PWM3SOCAEN" description="PWM3SOCAEN Enable for ADCSOCAOn " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PWM4SOCAEN" description="PWM4SOCAEN Enable for ADCSOCAOn " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PWM5SOCAEN" description="PWM5SOCAEN Enable for ADCSOCAOn " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PWM6SOCAEN" description="PWM6SOCAEN Enable for ADCSOCAOn " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PWM7SOCAEN" description="PWM7SOCAEN Enable for ADCSOCAOn " begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PWM8SOCAEN" description="PWM8SOCAEN Enable for ADCSOCAOn " begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PWM9SOCAEN" description="PWM9SOCAEN Enable for ADCSOCAOn " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PWM10SOCAEN" description="PWM10SOCAEN Enable for ADCSOCAOn " begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PWM11SOCAEN" description="PWM11SOCAEN Enable for ADCSOCAOn " begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PWM12SOCAEN" description="PWM12SOCAEN Enable for ADCSOCAOn " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PWM13SOCAEN" description="PWM13SOCAEN Enable for ADCSOCAOn" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PWM14SOCAEN" description="PWM14SOCAEN Enable for ADCSOCAOn" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PWM15SOCAEN" description="PWM15SOCAEN Enable for ADCSOCAOn" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PWM16SOCAEN" description="PWM16SOCAEN Enable for ADCSOCAOn" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="PWM1SOCBEN" description="PWM1SOCBEN Enable for ADCSOCBOn " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PWM2SOCBEN" description="PWM2SOCBEN Enable for ADCSOCBOn " begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PWM3SOCBEN" description="PWM3SOCBEN Enable for ADCSOCBOn " begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PWM4SOCBEN" description="PWM4SOCBEN Enable for ADCSOCBOn " begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PWM5SOCBEN" description="PWM5SOCBEN Enable for ADCSOCBOn " begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PWM6SOCBEN" description="PWM6SOCBEN Enable for ADCSOCBOn " begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PWM7SOCBEN" description="PWM7SOCBEN Enable for ADCSOCBOn " begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="PWM8SOCBEN" description="PWM8SOCBEN Enable for ADCSOCBOn " begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PWM9SOCBEN" description="PWM9SOCBEN Enable for ADCSOCBOn " begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PWM10SOCBEN" description="PWM10SOCBEN Enable for ADCSOCBOn " begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PWM11SOCBEN" description="PWM11SOCBEN Enable for ADCSOCBOn " begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PWM12SOCBEN" description="PWM12SOCBEN Enable for ADCSOCBOn " begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PWM13SOCBEN" description="PWM13SOCBEN Enable for ADCSOCBOn" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PWM14SOCBEN" description="PWM14SOCBEN Enable for ADCSOCBOn" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PWM15SOCBEN" description="PWM15SOCBEN Enable for ADCSOCBOn" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="PWM16SOCBEN" description="PWM16SOCBEN Enable for ADCSOCBOn" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SYNCSOCLOCK" width="32" page="1" offset="0x4" internal="0" description="SYNCSEL and EXTADCSOC Select Lock register">
		<bitfield id="SYNCSELECT" description="SYNCSEL Register Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EXTADCSOCSELECT" description="EXTADCSOCSEL Register Lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
